MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128l.h
extern volatile __C1FIFOCON4bits_t C1FIFOCON4bits __asm__ ("C1FIFOCON4") __attribute__((section("sfrs"), address(0xBF88B450)));
extern volatile uint32_t        C1FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF88B454)));
extern volatile uint32_t        C1FIFOCON4SET __attribute__((section("sfrs"),address(0xBF88B458)));
extern volatile uint32_t        C1FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88B45C)));
#define C1FIFOINT4 C1FIFOINT4
extern volatile uint32_t   C1FIFOINT4 __attribute__((section("sfrs"), address(0xBF88B460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT4bits_t;
extern volatile __C1FIFOINT4bits_t C1FIFOINT4bits __asm__ ("C1FIFOINT4") __attribute__((section("sfrs"), address(0xBF88B460)));
extern volatile uint32_t        C1FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF88B464)));
extern volatile uint32_t        C1FIFOINT4SET __attribute__((section("sfrs"),address(0xBF88B468)));
extern volatile uint32_t        C1FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88B46C)));
#define C1FIFOUA4 C1FIFOUA4
extern volatile uint32_t   C1FIFOUA4 __attribute__((section("sfrs"), address(0xBF88B470)));
extern volatile uint32_t        C1FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF88B474)));
extern volatile uint32_t        C1FIFOUA4SET __attribute__((section("sfrs"),address(0xBF88B478)));
extern volatile uint32_t        C1FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88B47C)));
#define C1FIFOCI4 C1FIFOCI4
extern volatile uint32_t   C1FIFOCI4 __attribute__((section("sfrs"), address(0xBF88B480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI4bits_t;
extern volatile __C1FIFOCI4bits_t C1FIFOCI4bits __asm__ ("C1FIFOCI4") __attribute__((section("sfrs"), address(0xBF88B480)));
extern volatile uint32_t        C1FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF88B484)));
extern volatile uint32_t        C1FIFOCI4SET __attribute__((section("sfrs"),address(0xBF88B488)));
extern volatile uint32_t        C1FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88B48C)));
#define C1FIFOCON5 C1FIFOCON5
extern volatile uint32_t   C1FIFOCON5 __attribute__((section("sfrs"), address(0xBF88B490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON5bits_t;
extern volatile __C1FIFOCON5bits_t C1FIFOCON5bits __asm__ ("C1FIFOCON5") __attribute__((section("sfrs"), address(0xBF88B490)));
extern volatile uint32_t        C1FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF88B494)));
extern volatile uint32_t        C1FIFOCON5SET __attribute__((section("sfrs"),address(0xBF88B498)));
extern volatile uint32_t        C1FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88B49C)));
#define C1FIFOINT5 C1FIFOINT5
extern volatile uint32_t   C1FIFOINT5 __attribute__((section("sfrs"), address(0xBF88B4A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT5bits_t;
extern volatile __C1FIFOINT5bits_t C1FIFOINT5bits __asm__ ("C1FIFOINT5") __attribute__((section("sfrs"), address(0xBF88B4A0)));
extern volatile uint32_t        C1FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF88B4A4)));
extern volatile uint32_t        C1FIFOINT5SET __attribute__((section("sfrs"),address(0xBF88B4A8)));
extern volatile uint32_t        C1FIFOINT5INV __attribute__((section("sfrs"),address(0xBF88B4AC)));
#define C1FIFOUA5 C1FIFOUA5
extern volatile uint32_t   C1FIFOUA5 __attribute__((section("sfrs"), address(0xBF88B4B0)));
extern volatile uint32_t        C1FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF88B4B4)));
extern volatile uint32_t        C1FIFOUA5SET __attribute__((section("sfrs"),address(0xBF88B4B8)));
extern volatile uint32_t        C1FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88B4BC)));
#define C1FIFOCI5 C1FIFOCI5
extern volatile uint32_t   C1FIFOCI5 __attribute__((section("sfrs"), address(0xBF88B4C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI5bits_t;
extern volatile __C1FIFOCI5bits_t C1FIFOCI5bits __asm__ ("C1FIFOCI5") __attribute__((section("sfrs"), address(0xBF88B4C0)));
extern volatile uint32_t        C1FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF88B4C4)));
extern volatile uint32_t        C1FIFOCI5SET __attribute__((section("sfrs"),address(0xBF88B4C8)));
extern volatile uint32_t        C1FIFOCI5INV __attribute__((section("sfrs"),address(0xBF88B4CC)));
#define C1FIFOCON6 C1FIFOCON6
extern volatile uint32_t   C1FIFOCON6 __attribute__((section("sfrs"), address(0xBF88B4D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON6bits_t;
