MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128l.h
extern volatile __C1FIFOCI15bits_t C1FIFOCI15bits __asm__ ("C1FIFOCI15") __attribute__((section("sfrs"), address(0xBF88B740)));
extern volatile uint32_t        C1FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF88B744)));
extern volatile uint32_t        C1FIFOCI15SET __attribute__((section("sfrs"),address(0xBF88B748)));
extern volatile uint32_t        C1FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88B74C)));
#define C1FIFOCON16 C1FIFOCON16
extern volatile uint32_t   C1FIFOCON16 __attribute__((section("sfrs"), address(0xBF88B750)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON16bits_t;
extern volatile __C1FIFOCON16bits_t C1FIFOCON16bits __asm__ ("C1FIFOCON16") __attribute__((section("sfrs"), address(0xBF88B750)));
extern volatile uint32_t        C1FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF88B754)));
extern volatile uint32_t        C1FIFOCON16SET __attribute__((section("sfrs"),address(0xBF88B758)));
extern volatile uint32_t        C1FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88B75C)));
#define C1FIFOINT16 C1FIFOINT16
extern volatile uint32_t   C1FIFOINT16 __attribute__((section("sfrs"), address(0xBF88B760)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT16bits_t;
extern volatile __C1FIFOINT16bits_t C1FIFOINT16bits __asm__ ("C1FIFOINT16") __attribute__((section("sfrs"), address(0xBF88B760)));
extern volatile uint32_t        C1FIFOINT16CLR __attribute__((section("sfrs"),address(0xBF88B764)));
extern volatile uint32_t        C1FIFOINT16SET __attribute__((section("sfrs"),address(0xBF88B768)));
extern volatile uint32_t        C1FIFOINT16INV __attribute__((section("sfrs"),address(0xBF88B76C)));
#define C1FIFOUA16 C1FIFOUA16
extern volatile uint32_t   C1FIFOUA16 __attribute__((section("sfrs"), address(0xBF88B770)));
extern volatile uint32_t        C1FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF88B774)));
extern volatile uint32_t        C1FIFOUA16SET __attribute__((section("sfrs"),address(0xBF88B778)));
extern volatile uint32_t        C1FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88B77C)));
#define C1FIFOCI16 C1FIFOCI16
extern volatile uint32_t   C1FIFOCI16 __attribute__((section("sfrs"), address(0xBF88B780)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI16bits_t;
extern volatile __C1FIFOCI16bits_t C1FIFOCI16bits __asm__ ("C1FIFOCI16") __attribute__((section("sfrs"), address(0xBF88B780)));
extern volatile uint32_t        C1FIFOCI16CLR __attribute__((section("sfrs"),address(0xBF88B784)));
extern volatile uint32_t        C1FIFOCI16SET __attribute__((section("sfrs"),address(0xBF88B788)));
extern volatile uint32_t        C1FIFOCI16INV __attribute__((section("sfrs"),address(0xBF88B78C)));
#define C1FIFOCON17 C1FIFOCON17
extern volatile uint32_t   C1FIFOCON17 __attribute__((section("sfrs"), address(0xBF88B790)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON17bits_t;
extern volatile __C1FIFOCON17bits_t C1FIFOCON17bits __asm__ ("C1FIFOCON17") __attribute__((section("sfrs"), address(0xBF88B790)));
extern volatile uint32_t        C1FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF88B794)));
extern volatile uint32_t        C1FIFOCON17SET __attribute__((section("sfrs"),address(0xBF88B798)));
extern volatile uint32_t        C1FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88B79C)));
#define C1FIFOINT17 C1FIFOINT17
extern volatile uint32_t   C1FIFOINT17 __attribute__((section("sfrs"), address(0xBF88B7A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT17bits_t;
extern volatile __C1FIFOINT17bits_t C1FIFOINT17bits __asm__ ("C1FIFOINT17") __attribute__((section("sfrs"), address(0xBF88B7A0)));
extern volatile uint32_t        C1FIFOINT17CLR __attribute__((section("sfrs"),address(0xBF88B7A4)));
extern volatile uint32_t        C1FIFOINT17SET __attribute__((section("sfrs"),address(0xBF88B7A8)));
extern volatile uint32_t        C1FIFOINT17INV __attribute__((section("sfrs"),address(0xBF88B7AC)));
#define C1FIFOUA17 C1FIFOUA17
extern volatile uint32_t   C1FIFOUA17 __attribute__((section("sfrs"), address(0xBF88B7B0)));
extern volatile uint32_t        C1FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF88B7B4)));
extern volatile uint32_t        C1FIFOUA17SET __attribute__((section("sfrs"),address(0xBF88B7B8)));
extern volatile uint32_t        C1FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88B7BC)));
#define C1FIFOCI17 C1FIFOCI17
extern volatile uint32_t   C1FIFOCI17 __attribute__((section("sfrs"), address(0xBF88B7C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI17bits_t;
extern volatile __C1FIFOCI17bits_t C1FIFOCI17bits __asm__ ("C1FIFOCI17") __attribute__((section("sfrs"), address(0xBF88B7C0)));
extern volatile uint32_t        C1FIFOCI17CLR __attribute__((section("sfrs"),address(0xBF88B7C4)));
extern volatile uint32_t        C1FIFOCI17SET __attribute__((section("sfrs"),address(0xBF88B7C8)));
extern volatile uint32_t        C1FIFOCI17INV __attribute__((section("sfrs"),address(0xBF88B7CC)));
#define C1FIFOCON18 C1FIFOCON18
extern volatile uint32_t   C1FIFOCON18 __attribute__((section("sfrs"), address(0xBF88B7D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON18bits_t;
extern volatile __C1FIFOCON18bits_t C1FIFOCON18bits __asm__ ("C1FIFOCON18") __attribute__((section("sfrs"), address(0xBF88B7D0)));
extern volatile uint32_t        C1FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF88B7D4)));
extern volatile uint32_t        C1FIFOCON18SET __attribute__((section("sfrs"),address(0xBF88B7D8)));
extern volatile uint32_t        C1FIFOCON18INV __attribute__((section("sfrs"),address(0xBF88B7DC)));
#define C1FIFOINT18 C1FIFOINT18
extern volatile uint32_t   C1FIFOINT18 __attribute__((section("sfrs"), address(0xBF88B7E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT18bits_t;
extern volatile __C1FIFOINT18bits_t C1FIFOINT18bits __asm__ ("C1FIFOINT18") __attribute__((section("sfrs"), address(0xBF88B7E0)));
extern volatile uint32_t        C1FIFOINT18CLR __attribute__((section("sfrs"),address(0xBF88B7E4)));
extern volatile uint32_t        C1FIFOINT18SET __attribute__((section("sfrs"),address(0xBF88B7E8)));
extern volatile uint32_t        C1FIFOINT18INV __attribute__((section("sfrs"),address(0xBF88B7EC)));
#define C1FIFOUA18 C1FIFOUA18
extern volatile uint32_t   C1FIFOUA18 __attribute__((section("sfrs"), address(0xBF88B7F0)));
extern volatile uint32_t        C1FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF88B7F4)));
extern volatile uint32_t        C1FIFOUA18SET __attribute__((section("sfrs"),address(0xBF88B7F8)));
extern volatile uint32_t        C1FIFOUA18INV __attribute__((section("sfrs"),address(0xBF88B7FC)));
#define C1FIFOCI18 C1FIFOCI18
extern volatile uint32_t   C1FIFOCI18 __attribute__((section("sfrs"), address(0xBF88B800)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI18bits_t;
extern volatile __C1FIFOCI18bits_t C1FIFOCI18bits __asm__ ("C1FIFOCI18") __attribute__((section("sfrs"), address(0xBF88B800)));
extern volatile uint32_t        C1FIFOCI18CLR __attribute__((section("sfrs"),address(0xBF88B804)));
extern volatile uint32_t        C1FIFOCI18SET __attribute__((section("sfrs"),address(0xBF88B808)));
extern volatile uint32_t        C1FIFOCI18INV __attribute__((section("sfrs"),address(0xBF88B80C)));
#define C1FIFOCON19 C1FIFOCON19
extern volatile uint32_t   C1FIFOCON19 __attribute__((section("sfrs"), address(0xBF88B810)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON19bits_t;
