MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128l.h
extern volatile __C1FIFOCON29bits_t C1FIFOCON29bits __asm__ ("C1FIFOCON29") __attribute__((section("sfrs"), address(0xBF88BA90)));
extern volatile uint32_t        C1FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF88BA94)));
extern volatile uint32_t        C1FIFOCON29SET __attribute__((section("sfrs"),address(0xBF88BA98)));
extern volatile uint32_t        C1FIFOCON29INV __attribute__((section("sfrs"),address(0xBF88BA9C)));
#define C1FIFOINT29 C1FIFOINT29
extern volatile uint32_t   C1FIFOINT29 __attribute__((section("sfrs"), address(0xBF88BAA0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT29bits_t;
extern volatile __C1FIFOINT29bits_t C1FIFOINT29bits __asm__ ("C1FIFOINT29") __attribute__((section("sfrs"), address(0xBF88BAA0)));
extern volatile uint32_t        C1FIFOINT29CLR __attribute__((section("sfrs"),address(0xBF88BAA4)));
extern volatile uint32_t        C1FIFOINT29SET __attribute__((section("sfrs"),address(0xBF88BAA8)));
extern volatile uint32_t        C1FIFOINT29INV __attribute__((section("sfrs"),address(0xBF88BAAC)));
#define C1FIFOUA29 C1FIFOUA29
extern volatile uint32_t   C1FIFOUA29 __attribute__((section("sfrs"), address(0xBF88BAB0)));
extern volatile uint32_t        C1FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF88BAB4)));
extern volatile uint32_t        C1FIFOUA29SET __attribute__((section("sfrs"),address(0xBF88BAB8)));
extern volatile uint32_t        C1FIFOUA29INV __attribute__((section("sfrs"),address(0xBF88BABC)));
#define C1FIFOCI29 C1FIFOCI29
extern volatile uint32_t   C1FIFOCI29 __attribute__((section("sfrs"), address(0xBF88BAC0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI29bits_t;
extern volatile __C1FIFOCI29bits_t C1FIFOCI29bits __asm__ ("C1FIFOCI29") __attribute__((section("sfrs"), address(0xBF88BAC0)));
extern volatile uint32_t        C1FIFOCI29CLR __attribute__((section("sfrs"),address(0xBF88BAC4)));
extern volatile uint32_t        C1FIFOCI29SET __attribute__((section("sfrs"),address(0xBF88BAC8)));
extern volatile uint32_t        C1FIFOCI29INV __attribute__((section("sfrs"),address(0xBF88BACC)));
#define C1FIFOCON30 C1FIFOCON30
extern volatile uint32_t   C1FIFOCON30 __attribute__((section("sfrs"), address(0xBF88BAD0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON30bits_t;
extern volatile __C1FIFOCON30bits_t C1FIFOCON30bits __asm__ ("C1FIFOCON30") __attribute__((section("sfrs"), address(0xBF88BAD0)));
extern volatile uint32_t        C1FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF88BAD4)));
extern volatile uint32_t        C1FIFOCON30SET __attribute__((section("sfrs"),address(0xBF88BAD8)));
extern volatile uint32_t        C1FIFOCON30INV __attribute__((section("sfrs"),address(0xBF88BADC)));
#define C1FIFOINT30 C1FIFOINT30
extern volatile uint32_t   C1FIFOINT30 __attribute__((section("sfrs"), address(0xBF88BAE0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT30bits_t;
extern volatile __C1FIFOINT30bits_t C1FIFOINT30bits __asm__ ("C1FIFOINT30") __attribute__((section("sfrs"), address(0xBF88BAE0)));
extern volatile uint32_t        C1FIFOINT30CLR __attribute__((section("sfrs"),address(0xBF88BAE4)));
extern volatile uint32_t        C1FIFOINT30SET __attribute__((section("sfrs"),address(0xBF88BAE8)));
extern volatile uint32_t        C1FIFOINT30INV __attribute__((section("sfrs"),address(0xBF88BAEC)));
#define C1FIFOUA30 C1FIFOUA30
extern volatile uint32_t   C1FIFOUA30 __attribute__((section("sfrs"), address(0xBF88BAF0)));
extern volatile uint32_t        C1FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF88BAF4)));
extern volatile uint32_t        C1FIFOUA30SET __attribute__((section("sfrs"),address(0xBF88BAF8)));
extern volatile uint32_t        C1FIFOUA30INV __attribute__((section("sfrs"),address(0xBF88BAFC)));
#define C1FIFOCI30 C1FIFOCI30
extern volatile uint32_t   C1FIFOCI30 __attribute__((section("sfrs"), address(0xBF88BB00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI30bits_t;
extern volatile __C1FIFOCI30bits_t C1FIFOCI30bits __asm__ ("C1FIFOCI30") __attribute__((section("sfrs"), address(0xBF88BB00)));
extern volatile uint32_t        C1FIFOCI30CLR __attribute__((section("sfrs"),address(0xBF88BB04)));
extern volatile uint32_t        C1FIFOCI30SET __attribute__((section("sfrs"),address(0xBF88BB08)));
extern volatile uint32_t        C1FIFOCI30INV __attribute__((section("sfrs"),address(0xBF88BB0C)));
#define C1FIFOCON31 C1FIFOCON31
extern volatile uint32_t   C1FIFOCON31 __attribute__((section("sfrs"), address(0xBF88BB10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON31bits_t;
