MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx530f128l.h
#define _U5MODE_UARTEN_POSITION                  0x0000000F
#define _U5MODE_UARTEN_MASK                      0x00008000
#define _U5MODE_UARTEN_LENGTH                    0x00000001

#define _U5MODE_w_POSITION                       0x00000000
#define _U5MODE_w_MASK                           0xFFFFFFFF
#define _U5MODE_w_LENGTH                         0x00000020

#define _U9AMODE_STSEL_POSITION                  0x00000000
#define _U9AMODE_STSEL_MASK                      0x00000001
#define _U9AMODE_STSEL_LENGTH                    0x00000001

#define _U9AMODE_PDSEL_POSITION                  0x00000001
#define _U9AMODE_PDSEL_MASK                      0x00000006
#define _U9AMODE_PDSEL_LENGTH                    0x00000002

#define _U9AMODE_BRGH_POSITION                   0x00000003
#define _U9AMODE_BRGH_MASK                       0x00000008
#define _U9AMODE_BRGH_LENGTH                     0x00000001

#define _U9AMODE_RXINV_POSITION                  0x00000004
#define _U9AMODE_RXINV_MASK                      0x00000010
#define _U9AMODE_RXINV_LENGTH                    0x00000001

#define _U9AMODE_ABAUD_POSITION                  0x00000005
#define _U9AMODE_ABAUD_MASK                      0x00000020
#define _U9AMODE_ABAUD_LENGTH                    0x00000001

#define _U9AMODE_LPBACK_POSITION                 0x00000006
#define _U9AMODE_LPBACK_MASK                     0x00000040
#define _U9AMODE_LPBACK_LENGTH                   0x00000001

#define _U9AMODE_WAKE_POSITION                   0x00000007
#define _U9AMODE_WAKE_MASK                       0x00000080
#define _U9AMODE_WAKE_LENGTH                     0x00000001

#define _U9AMODE_UEN_POSITION                    0x00000008
#define _U9AMODE_UEN_MASK                        0x00000300
#define _U9AMODE_UEN_LENGTH                      0x00000002

#define _U9AMODE_RTSMD_POSITION                  0x0000000B
#define _U9AMODE_RTSMD_MASK                      0x00000800
#define _U9AMODE_RTSMD_LENGTH                    0x00000001

#define _U9AMODE_IREN_POSITION                   0x0000000C
#define _U9AMODE_IREN_MASK                       0x00001000
#define _U9AMODE_IREN_LENGTH                     0x00000001

#define _U9AMODE_SIDL_POSITION                   0x0000000D
#define _U9AMODE_SIDL_MASK                       0x00002000
#define _U9AMODE_SIDL_LENGTH                     0x00000001

#define _U9AMODE_ON_POSITION                     0x0000000F
#define _U9AMODE_ON_MASK                         0x00008000
#define _U9AMODE_ON_LENGTH                       0x00000001

#define _U9AMODE_PDSEL0_POSITION                 0x00000001
#define _U9AMODE_PDSEL0_MASK                     0x00000002
#define _U9AMODE_PDSEL0_LENGTH                   0x00000001

#define _U9AMODE_PDSEL1_POSITION                 0x00000002
#define _U9AMODE_PDSEL1_MASK                     0x00000004
#define _U9AMODE_PDSEL1_LENGTH                   0x00000001

#define _U9AMODE_UEN0_POSITION                   0x00000008
#define _U9AMODE_UEN0_MASK                       0x00000100
#define _U9AMODE_UEN0_LENGTH                     0x00000001

#define _U9AMODE_UEN1_POSITION                   0x00000009
#define _U9AMODE_UEN1_MASK                       0x00000200
#define _U9AMODE_UEN1_LENGTH                     0x00000001

#define _U9AMODE_USIDL_POSITION                  0x0000000D
#define _U9AMODE_USIDL_MASK                      0x00002000
#define _U9AMODE_USIDL_LENGTH                    0x00000001

#define _U9AMODE_UARTEN_POSITION                 0x0000000F
#define _U9AMODE_UARTEN_MASK                     0x00008000
#define _U9AMODE_UARTEN_LENGTH                   0x00000001

#define _U9AMODE_w_POSITION                      0x00000000
#define _U9AMODE_w_MASK                          0xFFFFFFFF
#define _U9AMODE_w_LENGTH                        0x00000020

#define _U5STA_URXDA_POSITION                    0x00000000
#define _U5STA_URXDA_MASK                        0x00000001
#define _U5STA_URXDA_LENGTH                      0x00000001

#define _U5STA_OERR_POSITION                     0x00000001
#define _U5STA_OERR_MASK                         0x00000002
#define _U5STA_OERR_LENGTH                       0x00000001

#define _U5STA_FERR_POSITION                     0x00000002
#define _U5STA_FERR_MASK                         0x00000004
#define _U5STA_FERR_LENGTH                       0x00000001

#define _U5STA_PERR_POSITION                     0x00000003
#define _U5STA_PERR_MASK                         0x00000008
#define _U5STA_PERR_LENGTH                       0x00000001

#define _U5STA_RIDLE_POSITION                    0x00000004
#define _U5STA_RIDLE_MASK                        0x00000010
#define _U5STA_RIDLE_LENGTH                      0x00000001

#define _U5STA_ADDEN_POSITION                    0x00000005
#define _U5STA_ADDEN_MASK                        0x00000020
#define _U5STA_ADDEN_LENGTH                      0x00000001

#define _U5STA_URXISEL_POSITION                  0x00000006
#define _U5STA_URXISEL_MASK                      0x000000C0
#define _U5STA_URXISEL_LENGTH                    0x00000002

#define _U5STA_TRMT_POSITION                     0x00000008
#define _U5STA_TRMT_MASK                         0x00000100
#define _U5STA_TRMT_LENGTH                       0x00000001

#define _U5STA_UTXBF_POSITION                    0x00000009
#define _U5STA_UTXBF_MASK                        0x00000200
#define _U5STA_UTXBF_LENGTH                      0x00000001

#define _U5STA_UTXEN_POSITION                    0x0000000A
#define _U5STA_UTXEN_MASK                        0x00000400
#define _U5STA_UTXEN_LENGTH                      0x00000001

#define _U5STA_UTXBRK_POSITION                   0x0000000B
#define _U5STA_UTXBRK_MASK                       0x00000800
#define _U5STA_UTXBRK_LENGTH                     0x00000001

#define _U5STA_URXEN_POSITION                    0x0000000C
#define _U5STA_URXEN_MASK                        0x00001000
#define _U5STA_URXEN_LENGTH                      0x00000001

#define _U5STA_UTXINV_POSITION                   0x0000000D
#define _U5STA_UTXINV_MASK                       0x00002000
#define _U5STA_UTXINV_LENGTH                     0x00000001

#define _U5STA_UTXISEL_POSITION                  0x0000000E
#define _U5STA_UTXISEL_MASK                      0x0000C000
#define _U5STA_UTXISEL_LENGTH                    0x00000002

